withExtension/0/blueprints/waterlevel/omega
    {
        type            inletOutlet;
        inletValue      uniform 0.25;
        value           uniform 0.25;
    }
    
