withExtension/system/decomposeParDict
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Code template and library provided by Thorenz, C. (2024), DOI: 10.3929/ethz-b-000675949

numberOfSubdomains 5; 

method          scotch;

distributed     no;

roots           ( );

// ************************************************************************* //
